skeleton-export/requisições/req_2026-02-12T22-14-52-459Z_SaveRecord.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>GlbConsSqlData</tot:DataServerName>
         <!--Optional:-->
         <tot:XML><![CDATA[<GlbConsSql>
  <GConsSql>
    <CODCOLIGADA>1</CODCOLIGADA>
    <APLICACAO>T</APLICACAO>
    <CODSENTENCA>SIT.PORTALRM.024</CODSENTENCA>
    <TITULO>Teste</TITULO>
    <SENTENCA><![CDATA[select * from gcoligada]]></SENTENCA>
    <TAMANHO>23</TAMANHO>
    <DTULTALTERACAO>2026-02-12T19:14:52.0000000-03:00</DTULTALTERACAO>
    <USRULTALTERACAO>mestre</USRULTALTERACAO>
    <DISPONIVELFILTRO>1</DISPONIVELFILTRO>
    <DISPONIVELRELATORIO>1</DISPONIVELRELATORIO>
    <DISPONIVELVISAO>1</DISPONIVELVISAO>
    <DISPONIVELMENU>0</DISPONIVELMENU>
    <SEMSEGCOLUNAS>0</SEMSEGCOLUNAS>
    <SEMSEGESTENDIDA>0</SEMSEGESTENDIDA>
    <GUID>9786a3af-26a8-4258-99d7-fa55975a9d69</GUID>
    <CONTROLE>85408</CONTROLE>
  </GConsSql>
</GlbConsSql>]]></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODCOLIGADA=1;CODUSUARIO='mestre';CODSISTEMA=T</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>